# CABBAGES and THINGS
## 
### Don Gledhill 
Add sidelights on America that the
negro vote elected William Hale
r i hotnpson mayor of Chicago on the
platform: "We'll make the King of
England keep his snoot out of Amer
ica."
♦ * *
We mourn the loss of Senior Ross,
He lies beneath the sod;
He dared suggest to someone's guest:
"No smoking on the Quad." —E.W.C.
* ♦ #
Indignant critics complain "Elmer

Gantry" is not typical. Quite so. All
Baptist ministers are not degenerate
circus barkers —nor as successful.
* * *
HA, HA!
They say
College is a joke.
It is.
When I get through
With finals I too
Will laugh
With the rest of the world*—
But not before. —J.L.S.
♦ • *
Establishing fundamental constitu
tional law for student government in
the great and candid West, according

to the Stanford Daily:
"The new draft of the constitution
corrects many defects that formerly
existed in the document The
chief revisions involve conformity to
the present practice."
* * *
PROFESSOR ESPINOSA TO GIVE
ADDRESS IN SAN FRANCISCO
—Daily Headline.
Why just one. There are SO MANY
good "addresses in San Francisco."
* * *
LAMENT
The "Libe" steps gripe us so.
We take a whole step up
But only half a step
W T e go.
Coming down is even worse,
One step —too short;
Two —too far.
This gripes us more,
B'gar! —V.C.
4s * *
One more reason why we can do so
well without royalty in America. Queen
Victoria makes all her women wear !
skirts not more than four inches from i
the floor.
